zsh-utilities-settings.org
#+TITLE:  Zsh Utilities Settings
#+AUTHOR: Xavier Garrido
#+DATE:   2013-02-12
#+OPTIONS: toc:nil num:nil ^:nil

* Zsh Utilities - Settings
This file provides some default settings for =zsh= (currently not so much).

** Set extended globbing
#+BEGIN_SRC sh
  setopt extended_glob
#+END_SRC
** Disable autocorrect
#+BEGIN_SRC sh
  unsetopt correct_all
#+END_SRC

** Binding keys
*** Undo
#+BEGIN_SRC sh
  bindkey '\C-z' undo
#+END_SRC
*** Move history search
#+BEGIN_SRC sh
  # bind up and down arrow keys
  zmodload zsh/terminfo
  bindkey "$terminfo[kcuu1]" history-substring-search-up
  bindkey "$terminfo[kcud1]" history-substring-search-down
#+END_SRC
*** For/backward word
#+BEGIN_SRC sh
  bindkey "^[[1;3C" forward-word
  bindkey "^[[1;3D" backward-word
#+END_SRC
