zsh-utilities-settings.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Zsh Utilities Settings</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Xavier Garrido" />
<link rel="stylesheet" href="css/styles.css" />
               <link rel="stylesheet" href="css/org-pygments.css" />
               <link rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" />
</head>
<body onload="randomLinkColor();displayTOC();"><div id="toc"></div>
<div id="preamble" class="status">
 <a href="https://github.com/xgarrido/zsh-utilities"><i class="fa fa-github"></i></a><br/> 
</div>
<div id="content">
<h1 class="title">Zsh Utilities Settings</h1>

<div id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">Zsh Utilities - Settings</h2>
<div class="outline-text-2" id="text-unnumbered-1">
<p>
This file provides some default settings for <code>zsh</code> (currently not so much).
</p>
</div>

<div id="outline-container-unnumbered-2" class="outline-3">
<h3 id="unnumbered-2">Set extended globbing</h3>
<div class="outline-text-3" id="text-unnumbered-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">setopt</span> extended_glob
</pre>
</div>
</div>
</div>
<div id="outline-container-unnumbered-3" class="outline-3">
<h3 id="unnumbered-3">Disable autocorrect</h3>
<div class="outline-text-3" id="text-unnumbered-3">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">unsetopt</span> correct_all
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-4" class="outline-3">
<h3 id="unnumbered-4">Binding keys</h3>
<div class="outline-text-3" id="text-unnumbered-4">
</div><div id="outline-container-unnumbered-5" class="outline-4">
<h4 id="unnumbered-5">Undo</h4>
<div class="outline-text-4" id="text-unnumbered-5">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">bindkey</span> <span class="org-string">'\C-z'</span> undo
</pre>
</div>
</div>
</div>
<div id="outline-container-unnumbered-6" class="outline-4">
<h4 id="unnumbered-6">Move history search</h4>
<div class="outline-text-4" id="text-unnumbered-6">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">bind up and down arrow keys</span>
zmodload zsh/terminfo
<span class="org-builtin">bindkey</span> <span class="org-string">"$terminfo[kcuu1]"</span> history-substring-search-up
<span class="org-builtin">bindkey</span> <span class="org-string">"$terminfo[kcud1]"</span> history-substring-search-down
</pre>
</div>
</div>
</div>
<div id="outline-container-unnumbered-7" class="outline-4">
<h4 id="unnumbered-7">For/backward word</h4>
<div class="outline-text-4" id="text-unnumbered-7">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-builtin">bindkey</span> <span class="org-string">"^[[1;3C"</span> forward-word
<span class="org-builtin">bindkey</span> <span class="org-string">"^[[1;3D"</span> backward-word
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
File under <i class="fa fa-github-alt"></i> version control - commit <a href="https://github.com/xgarrido/zsh-utilities/commit/b7f7874ac2e22ead7c0cd912dec7d91f04df1951">b7f7874</a> - 2014-11-07
</div>
</body>
</html>
